; domain
(define (domain ranchyard)
(:requirements :typing :fluents)
(:types range range_asset - object
  homestead outpost - range
        wagon lariat platform - range_asset
        skid bale - platform)

(:predicates (grazing_at ?x - range_asset ?y - range)
             (stacked_on ?x - bale ?y - platform)
             (loaded_in ?x - bale ?y - wagon)
             (hauling ?x - lariat ?y - bale)
             (ready ?x - lariat)
             (bare ?x - platform)
)

(:functions
  (wagon_cap ?t - wagon)
  (current_haul ?t - wagon)
  (mass ?c - bale)
  (feed-cost)
)

(:action mosey
:parameters (?x - wagon ?y - range ?z - range)
:precondition (and (grazing_at ?x ?y))
:effect (and (not (grazing_at ?x ?y)) (grazing_at ?x ?z)
    (increase (feed-cost) 10)))

(:action rope_up
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (ready ?x) (grazing_at ?y ?p) (stacked_on ?y ?z) (bare ?y))
:effect (and (not (grazing_at ?y ?p)) (hauling ?x ?y) (not (bare ?y)) (not (ready ?x))
             (bare ?z) (not (stacked_on ?y ?z)) (increase (feed-cost) 1)))

(:action rope_down
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (bare ?z) (hauling ?x ?y))
:effect (and (ready ?x) (not (hauling ?x ?y)) (grazing_at ?y ?p) (not (bare ?z)) (bare ?y)
    (stacked_on ?y ?z)))

(:action wrangle_in
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (hauling ?x ?y)
    (<= (+ (current_haul ?z) (mass ?y)) (wagon_cap ?z)))
:effect (and (not (hauling ?x ?y)) (loaded_in ?y ?z) (ready ?x)
    (increase (current_haul ?z) (mass ?y))))

(:action wrangle_out
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
:effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hauling ?x ?y)
    (decrease (current_haul ?z) (mass ?y))))

)

; problem
(define (problem ranchyard-p01) (:domain ranchyard)
(:objects
  homestead0 - homestead
  outpost0 outpost1 - outpost
  wagon0 wagon1 - wagon
  skid0 skid1 skid2 - skid
  bale0 bale1 bale2 bale3 bale4 bale5 bale6 bale7 bale8 bale9 - bale
  lariat0 lariat1 lariat2 - lariat)
(:init
  (grazing_at skid0 homestead0)
  (bare bale6)
  (grazing_at skid1 outpost0)
  (bare bale9)
  (grazing_at skid2 outpost1)
  (bare bale8)
  (grazing_at wagon0 outpost1)
  (= (current_haul wagon0) 0)
  (= (wagon_cap wagon0) 438)
  (grazing_at wagon1 outpost0)
  (= (current_haul wagon1) 0)
  (= (wagon_cap wagon1) 331)
  (grazing_at lariat0 homestead0)
  (ready lariat0)
  (grazing_at lariat1 outpost0)
  (ready lariat1)
  (grazing_at lariat2 outpost1)
  (ready lariat2)
  (grazing_at bale0 homestead0)
  (stacked_on bale0 skid0)
  (= (mass bale0) 4)
  (grazing_at bale1 outpost1)
  (stacked_on bale1 skid2)
  (= (mass bale1) 41)
  (grazing_at bale2 outpost1)
  (stacked_on bale2 bale1)
  (= (mass bale2) 91)
  (grazing_at bale3 outpost0)
  (stacked_on bale3 skid1)
  (= (mass bale3) 81)
  (grazing_at bale4 homestead0)
  (stacked_on bale4 bale0)
  (= (mass bale4) 77)
  (grazing_at bale5 outpost1)
  (stacked_on bale5 bale2)
  (= (mass bale5) 33)
  (grazing_at bale6 homestead0)
  (stacked_on bale6 bale4)
  (= (mass bale6) 17)
  (grazing_at bale7 outpost1)
  (stacked_on bale7 bale5)
  (= (mass bale7) 27)
  (grazing_at bale8 outpost1)
  (stacked_on bale8 bale7)
  (= (mass bale8) 88)
  (grazing_at bale9 outpost0)
  (stacked_on bale9 bale3)
  (= (mass bale9) 46)
  (= (feed-cost) 0)
)

(:goal (and
    (stacked_on bale0 skid1)
    (stacked_on bale1 bale5)
    (stacked_on bale2 bale1)
    (stacked_on bale3 skid0)
    (stacked_on bale4 bale3)
    (stacked_on bale5 bale6)
    (stacked_on bale6 skid2)
    (stacked_on bale7 bale4)
    (stacked_on bale8 bale2)
  )
)

(:metric minimize (total-time)))

; plan
1. (rope_up lariat1 bale9 bale3 outpost0)
   deleted: (grazing_at bale9 outpost0) (bare bale9) (ready lariat1) (stacked_on bale9 bale3)
   added: (hauling lariat1 bale9) (bare bale3)
   changed: (feed-cost) from 0 to 1
   goals met: 1 of 9
2. (wrangle_in lariat1 bale9 wagon1 outpost0)
   deleted: (hauling lariat1 bale9)
   added: (loaded_in bale9 wagon1) (ready lariat1)
   changed: (current_haul wagon1) from 0 to 46
   goals met: 1 of 9
3. (rope_up lariat1 bale3 skid1 outpost0)
   deleted: (grazing_at bale3 outpost0) (bare bale3) (ready lariat1) (stacked_on bale3 skid1)
   added: (hauling lariat1 bale3) (bare skid1)
   changed: (feed-cost) from 1 to 2
   goals met: 1 of 9
4. (wrangle_in lariat1 bale3 wagon1 outpost0)
   deleted: (hauling lariat1 bale3)
   added: (loaded_in bale3 wagon1) (ready lariat1)
   changed: (current_haul wagon1) from 46 to 127
   goals met: 1 of 9
5. (mosey wagon1 outpost0 homestead0)
   deleted: (grazing_at wagon1 outpost0)
   added: (grazing_at wagon1 homestead0)
   changed: (feed-cost) from 2 to 12
   goals met: 1 of 9
6. (wrangle_out lariat0 bale3 wagon1 homestead0)
   deleted: (loaded_in bale3 wagon1) (ready lariat0)
   added: (hauling lariat0 bale3)
   changed: (current_haul wagon1) from 127 to 46
   goals met: 1 of 9
7. (rope_up lariat2 bale8 bale7 outpost1)
   deleted: (grazing_at bale8 outpost1) (bare bale8) (ready lariat2) (stacked_on bale8 bale7)
   added: (hauling lariat2 bale8) (bare bale7)
   changed: (feed-cost) from 12 to 13
   goals met: 1 of 9
8. (wrangle_in lariat2 bale8 wagon0 outpost1)
   deleted: (hauling lariat2 bale8)
   added: (loaded_in bale8 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 0 to 88
   goals met: 1 of 9
9. (rope_up lariat2 bale7 bale5 outpost1)
   deleted: (grazing_at bale7 outpost1) (bare bale7) (ready lariat2) (stacked_on bale7 bale5)
   added: (hauling lariat2 bale7) (bare bale5)
   changed: (feed-cost) from 13 to 14
   goals met: 1 of 9
10. (wrangle_in lariat2 bale7 wagon0 outpost1)
   deleted: (hauling lariat2 bale7)
   added: (loaded_in bale7 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 88 to 115
   goals met: 1 of 9
11. (rope_up lariat2 bale5 bale2 outpost1)
   deleted: (grazing_at bale5 outpost1) (bare bale5) (ready lariat2) (stacked_on bale5 bale2)
   added: (hauling lariat2 bale5) (bare bale2)
   changed: (feed-cost) from 14 to 15
   goals met: 1 of 9
12. (wrangle_in lariat2 bale5 wagon0 outpost1)
   deleted: (hauling lariat2 bale5)
   added: (loaded_in bale5 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 115 to 148
   goals met: 1 of 9
13. (wrangle_out lariat2 bale8 wagon0 outpost1)
   deleted: (loaded_in bale8 wagon0) (ready lariat2)
   added: (hauling lariat2 bale8)
   changed: (current_haul wagon0) from 148 to 60
   goals met: 1 of 9
14. (wrangle_in lariat0 bale3 wagon1 homestead0)
   deleted: (hauling lariat0 bale3)
   added: (loaded_in bale3 wagon1) (ready lariat0)
   changed: (current_haul wagon1) from 46 to 127
   goals met: 1 of 9
15. (rope_up lariat0 bale6 bale4 homestead0)
   deleted: (grazing_at bale6 homestead0) (bare bale6) (ready lariat0) (stacked_on bale6 bale4)
   added: (hauling lariat0 bale6) (bare bale4)
   changed: (feed-cost) from 15 to 16
   goals met: 1 of 9
16. (wrangle_in lariat0 bale6 wagon1 homestead0)
   deleted: (hauling lariat0 bale6)
   added: (loaded_in bale6 wagon1) (ready lariat0)
   changed: (current_haul wagon1) from 127 to 144
   goals met: 1 of 9
17. (rope_up lariat0 bale4 bale0 homestead0)
   deleted: (grazing_at bale4 homestead0) (bare bale4) (ready lariat0) (stacked_on bale4 bale0)
   added: (hauling lariat0 bale4) (bare bale0)
   changed: (feed-cost) from 16 to 17
   goals met: 1 of 9
18. (wrangle_in lariat2 bale8 wagon0 outpost1)
   deleted: (hauling lariat2 bale8)
   added: (loaded_in bale8 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 60 to 148
   goals met: 1 of 9
19. (mosey wagon1 homestead0 outpost1)
   deleted: (grazing_at wagon1 homestead0)
   added: (grazing_at wagon1 outpost1)
   changed: (feed-cost) from 17 to 27
   goals met: 1 of 9
20. (wrangle_out lariat2 bale6 wagon1 outpost1)
   deleted: (loaded_in bale6 wagon1) (ready lariat2)
   added: (hauling lariat2 bale6)
   changed: (current_haul wagon1) from 144 to 127
   goals met: 1 of 9
21. (mosey wagon1 outpost1 homestead0)
   deleted: (grazing_at wagon1 outpost1)
   added: (grazing_at wagon1 homestead0)
   changed: (feed-cost) from 27 to 37
   goals met: 1 of 9
22. (rope_down lariat2 bale6 bale2 outpost1)
   deleted: (hauling lariat2 bale6) (bare bale2)
   added: (ready lariat2) (grazing_at bale6 outpost1) (bare bale6) (stacked_on bale6 bale2)
   goals met: 1 of 9
23. (wrangle_out lariat2 bale5 wagon0 outpost1)
   deleted: (loaded_in bale5 wagon0) (ready lariat2)
   added: (hauling lariat2 bale5)
   changed: (current_haul wagon0) from 148 to 115
   goals met: 1 of 9
24. (wrangle_in lariat0 bale4 wagon1 homestead0)
   deleted: (hauling lariat0 bale4)
   added: (loaded_in bale4 wagon1) (ready lariat0)
   changed: (current_haul wagon1) from 127 to 204
   goals met: 1 of 9
25. (rope_up lariat0 bale0 skid0 homestead0)
   deleted: (grazing_at bale0 homestead0) (bare bale0) (ready lariat0) (stacked_on bale0 skid0)
   added: (hauling lariat0 bale0) (bare skid0)
   changed: (feed-cost) from 37 to 38
   goals met: 1 of 9
26. (wrangle_in lariat0 bale0 wagon1 homestead0)
   deleted: (hauling lariat0 bale0)
   added: (loaded_in bale0 wagon1) (ready lariat0)
   changed: (current_haul wagon1) from 204 to 208
   goals met: 1 of 9
27. (wrangle_out lariat0 bale3 wagon1 homestead0)
   deleted: (loaded_in bale3 wagon1) (ready lariat0)
   added: (hauling lariat0 bale3)
   changed: (current_haul wagon1) from 208 to 127
   goals met: 1 of 9
28. (rope_down lariat0 bale3 skid0 homestead0)
   deleted: (hauling lariat0 bale3) (bare skid0)
   added: (ready lariat0) (grazing_at bale3 homestead0) (bare bale3) (stacked_on bale3 skid0)
   goals met: 2 of 9
29. (wrangle_out lariat0 bale4 wagon1 homestead0)
   deleted: (loaded_in bale4 wagon1) (ready lariat0)
   added: (hauling lariat0 bale4)
   changed: (current_haul wagon1) from 127 to 50
   goals met: 2 of 9
30. (mosey wagon1 homestead0 outpost0)
   deleted: (grazing_at wagon1 homestead0)
   added: (grazing_at wagon1 outpost0)
   changed: (feed-cost) from 38 to 48
   goals met: 2 of 9
31. (rope_down lariat0 bale4 bale3 homestead0)
   deleted: (hauling lariat0 bale4) (bare bale3)
   added: (ready lariat0) (grazing_at bale4 homestead0) (bare bale4) (stacked_on bale4 bale3)
   goals met: 3 of 9
32. (wrangle_out lariat1 bale0 wagon1 outpost0)
   deleted: (loaded_in bale0 wagon1) (ready lariat1)
   added: (hauling lariat1 bale0)
   changed: (current_haul wagon1) from 50 to 46
   goals met: 3 of 9
33. (rope_down lariat1 bale0 skid1 outpost0)
   deleted: (hauling lariat1 bale0) (bare skid1)
   added: (ready lariat1) (grazing_at bale0 outpost0) (bare bale0) (stacked_on bale0 skid1)
   goals met: 4 of 9
34. (mosey wagon0 outpost1 homestead0)
   deleted: (grazing_at wagon0 outpost1)
   added: (grazing_at wagon0 homestead0)
   changed: (feed-cost) from 48 to 58
   goals met: 4 of 9
35. (wrangle_out lariat0 bale7 wagon0 homestead0)
   deleted: (loaded_in bale7 wagon0) (ready lariat0)
   added: (hauling lariat0 bale7)
   changed: (current_haul wagon0) from 115 to 88
   goals met: 4 of 9
36. (mosey wagon0 homestead0 outpost1)
   deleted: (grazing_at wagon0 homestead0)
   added: (grazing_at wagon0 outpost1)
   changed: (feed-cost) from 58 to 68
   goals met: 4 of 9
37. (rope_down lariat0 bale7 bale4 homestead0)
   deleted: (hauling lariat0 bale7) (bare bale4)
   added: (ready lariat0) (grazing_at bale7 homestead0) (bare bale7) (stacked_on bale7 bale4)
   goals met: 5 of 9
38. (wrangle_in lariat2 bale5 wagon0 outpost1)
   deleted: (hauling lariat2 bale5)
   added: (loaded_in bale5 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 88 to 121
   goals met: 5 of 9
39. (rope_up lariat2 bale6 bale2 outpost1)
   deleted: (grazing_at bale6 outpost1) (bare bale6) (ready lariat2) (stacked_on bale6 bale2)
   added: (hauling lariat2 bale6) (bare bale2)
   changed: (feed-cost) from 68 to 69
   goals met: 5 of 9
40. (wrangle_in lariat2 bale6 wagon0 outpost1)
   deleted: (hauling lariat2 bale6)
   added: (loaded_in bale6 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 121 to 138
   goals met: 5 of 9
41. (wrangle_out lariat2 bale8 wagon0 outpost1)
   deleted: (loaded_in bale8 wagon0) (ready lariat2)
   added: (hauling lariat2 bale8)
   changed: (current_haul wagon0) from 138 to 50
   goals met: 5 of 9
42. (rope_down lariat2 bale8 bale2 outpost1)
   deleted: (hauling lariat2 bale8) (bare bale2)
   added: (ready lariat2) (grazing_at bale8 outpost1) (bare bale8) (stacked_on bale8 bale2)
   goals met: 6 of 9
43. (wrangle_out lariat2 bale6 wagon0 outpost1)
   deleted: (loaded_in bale6 wagon0) (ready lariat2)
   added: (hauling lariat2 bale6)
   changed: (current_haul wagon0) from 50 to 33
   goals met: 6 of 9
44. (rope_down lariat2 bale6 bale8 outpost1)
   deleted: (hauling lariat2 bale6) (bare bale8)
   added: (ready lariat2) (grazing_at bale6 outpost1) (bare bale6) (stacked_on bale6 bale8)
   goals met: 6 of 9
45. (rope_up lariat2 bale6 bale8 outpost1)
   deleted: (grazing_at bale6 outpost1) (bare bale6) (ready lariat2) (stacked_on bale6 bale8)
   added: (hauling lariat2 bale6) (bare bale8)
   changed: (feed-cost) from 69 to 70
   goals met: 6 of 9
46. (wrangle_in lariat2 bale6 wagon0 outpost1)
   deleted: (hauling lariat2 bale6)
   added: (loaded_in bale6 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 33 to 50
   goals met: 6 of 9
47. (rope_up lariat2 bale8 bale2 outpost1)
   deleted: (grazing_at bale8 outpost1) (bare bale8) (ready lariat2) (stacked_on bale8 bale2)
   added: (hauling lariat2 bale8) (bare bale2)
   changed: (feed-cost) from 70 to 71
   goals met: 5 of 9
48. (wrangle_in lariat2 bale8 wagon0 outpost1)
   deleted: (hauling lariat2 bale8)
   added: (loaded_in bale8 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 50 to 138
   goals met: 5 of 9
49. (rope_up lariat2 bale2 bale1 outpost1)
   deleted: (grazing_at bale2 outpost1) (bare bale2) (ready lariat2) (stacked_on bale2 bale1)
   added: (hauling lariat2 bale2) (bare bale1)
   changed: (feed-cost) from 71 to 72
   goals met: 4 of 9
50. (wrangle_in lariat2 bale2 wagon0 outpost1)
   deleted: (hauling lariat2 bale2)
   added: (loaded_in bale2 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 138 to 229
   goals met: 4 of 9
51. (rope_up lariat2 bale1 skid2 outpost1)
   deleted: (grazing_at bale1 outpost1) (bare bale1) (ready lariat2) (stacked_on bale1 skid2)
   added: (hauling lariat2 bale1) (bare skid2)
   changed: (feed-cost) from 72 to 73
   goals met: 4 of 9
52. (wrangle_in lariat2 bale1 wagon0 outpost1)
   deleted: (hauling lariat2 bale1)
   added: (loaded_in bale1 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 229 to 270
   goals met: 4 of 9
53. (wrangle_out lariat2 bale6 wagon0 outpost1)
   deleted: (loaded_in bale6 wagon0) (ready lariat2)
   added: (hauling lariat2 bale6)
   changed: (current_haul wagon0) from 270 to 253
   goals met: 4 of 9
54. (rope_down lariat2 bale6 skid2 outpost1)
   deleted: (hauling lariat2 bale6) (bare skid2)
   added: (ready lariat2) (grazing_at bale6 outpost1) (bare bale6) (stacked_on bale6 skid2)
   goals met: 5 of 9
55. (wrangle_out lariat2 bale5 wagon0 outpost1)
   deleted: (loaded_in bale5 wagon0) (ready lariat2)
   added: (hauling lariat2 bale5)
   changed: (current_haul wagon0) from 253 to 220
   goals met: 5 of 9
56. (rope_down lariat2 bale5 bale6 outpost1)
   deleted: (hauling lariat2 bale5) (bare bale6)
   added: (ready lariat2) (grazing_at bale5 outpost1) (bare bale5) (stacked_on bale5 bale6)
   goals met: 6 of 9
57. (wrangle_out lariat2 bale1 wagon0 outpost1)
   deleted: (loaded_in bale1 wagon0) (ready lariat2)
   added: (hauling lariat2 bale1)
   changed: (current_haul wagon0) from 220 to 179
   goals met: 6 of 9
58. (rope_down lariat2 bale1 bale5 outpost1)
   deleted: (hauling lariat2 bale1) (bare bale5)
   added: (ready lariat2) (grazing_at bale1 outpost1) (bare bale1) (stacked_on bale1 bale5)
   goals met: 7 of 9
59. (wrangle_out lariat2 bale2 wagon0 outpost1)
   deleted: (loaded_in bale2 wagon0) (ready lariat2)
   added: (hauling lariat2 bale2)
   changed: (current_haul wagon0) from 179 to 88
   goals met: 7 of 9
60. (rope_down lariat2 bale2 bale1 outpost1)
   deleted: (hauling lariat2 bale2) (bare bale1)
   added: (ready lariat2) (grazing_at bale2 outpost1) (bare bale2) (stacked_on bale2 bale1)
   goals met: 8 of 9
61. (wrangle_out lariat2 bale8 wagon0 outpost1)
   deleted: (loaded_in bale8 wagon0) (ready lariat2)
   added: (hauling lariat2 bale8)
   changed: (current_haul wagon0) from 88 to 0
   goals met: 8 of 9
62. (rope_down lariat2 bale8 bale2 outpost1)
   deleted: (hauling lariat2 bale8) (bare bale2)
   added: (ready lariat2) (grazing_at bale8 outpost1) (bare bale8) (stacked_on bale8 bale2)
   goals met: 9 of 9
